# email (наявність @, домену: gmail.com наприклад, мінімальна довжина та максимальна на ваш вибір)
import re

while True:
    inputString = input("Введіть e-mail: ")
    eMail = re.fullmatch(r'\S+@\w+\.\w{1,3}', inputString)  # \S+ - один або більше непробільних символів
                                                                   # (до символу @ можна написати все що завгодно,
                                                                   # головне без пробілів),
                                                                   # \w+ - один або більше буквених символів, як ім'я
                                                                   # домену
                                                                   # \. - екрануємо "крапочку", щоб це був не будь-який
                                                                   # символ, а саме "крапка"
                                                                   # \w{1,3} - домен верхнього рівня, від одного до
                                                                   # трьох буквених символів
    if eMail is None:
        print("Невірний формат вводу!")
        continue
    print("Введення вірне!")
    break